AUTO_config_TK_pesok/src/Reports/ПродажиВНоль/ПродажиВНоль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПродажиВНоль</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склады</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьСклады</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

AUTO_config_TK_pesok/src/AccumulationRegisters/ПартииТоваровКомпании/ПартииТоваровКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПартииТоваровКомпании</name>
  <resources>
    <name>Количество</name>
    <comment>Количественный остаток товара на складе в разрезе партий</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>Сумма без доп. расходов в валюте регламентированного учета с налогами</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБаз</name>
    <comment>Содержит сумму в базовой валюте</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <comment>Сумма НДС в валюте регламентированного учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>Ставка НДС</comment>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <dimensions>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура (товар, услуга и т.п.)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <comment>Характеристика/серия номенклатуры</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ТипыПартий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусПартии</name>
    <comment>Статус партии, определяющий, чей товар (купленный компанией или принятый на комиссию)</comment>
    <type>
      <types>EnumRef.СтатусыПартий</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/AccumulationRegisters/ОстаткиТоваровКомпании/ОстаткиТоваровКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваровКомпании</name>
  <comment>Блок учета остатков товаров компании</comment>
  <resources>
    <name>Количество</name>
    <comment>Количественный остаток номенклатуры на складе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Контрагент или подразделение получатель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <dimensions>
    <name>СкладКомпании</name>
    <comment>Склад компании</comment>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <comment>Характеристика номенклатуры</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ОграничениеАссортимента/ОграничениеАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОграничениеАссортимента</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <comment>0-не введено, 1-введено, 2-РаспродажаСПоследующимВыводом</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БазовыйАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидАссортимента</name>
    <type>
      <types>CatalogRef.ВидыАссортимента</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  </aggregates>
  <resources>
    <name>Количество</name>
    <comment>Количество проданного товара</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>Сумма с учетом налогов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <comment>Сумма НДС в валюте регл. учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСкидки</name>
    <comment>Сумма скидки в валюте регл. учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма упр. учета с учетом налогов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <comment>Себестоимость регл. учета с учетом налогов но без доп. расходов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДСВходящий</name>
    <comment>Сумма входящего НДС в валюте регл. учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СебестоимостьУпр</name>
    <comment>Себестоимость упр. учета с учетом налогов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаАкциза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был зафиксирован факт продажи товара</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладКомпании</name>
    <comment>Склад компании</comment>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Проданный товар или оказанная услуга</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <comment>Характеристика номенклатуры</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлассификаторПродажи</name>
    <type>
      <types>CatalogRef.КлассификаторПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <comment>Поставщик у которого товар был куплен</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупатель</name>
    <comment>Покупатель который купил товар или которому была оказана услуга</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорВзаиморасчетов</name>
    <comment>Договор взаиморасчетов с покупателем</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <comment>Ставка НДС</comment>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусПартии</name>
    <comment>Статус партии, определяющий, чей товар мы продали (собственный компанией или принятый на комиссию)</comment>
    <type>
      <types>EnumRef.СтатусыПартий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <comment>Партия</comment>
    <type>
      <types>DefinedType.ТипыПартий</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <comment>Цена</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЦенаСтарая</name>
    <comment>Цена старая</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипЦен</name>
    <comment>Тип цен для которого хранятся цены</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура для которой сохраняются цены</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <comment>(АСУ) Характеристика/серия номенклатуры</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_ОптимальноеКоличествоНоменклатуры/ТК_ОптимальноеКоличествоНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_ОптимальноеКоличествоНоменклатуры</name>
  <comment>Хранит данные об оптимальных остатках номенклатуры на складах</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>МодельЗаказа</name>
    <type>
      <types>EnumRef.ВидыКоличестваЗаказа</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОкругления</name>
    <type>
      <types>EnumRef.ВариантыОкругленияКоличества</types>
    </type>
  </resources>
  <resources>
    <name>МинимальныйОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальныйЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоДоговоруОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВитринаОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КвантПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура (товар, услуга и т.п.)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/РезультатыВыполненияОбработок/РезультатыВыполненияОбработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыВыполненияОбработок</name>
  <resources>
    <name>Успешный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СообщенияОбОшибках</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Reports/ПродажиВНоль/ManagerModule.bsl
Функция ПолучитьТовары(ПараметрыОтчета)
	#Если Клиент Тогда
		Состояние("Получаем список товаров...");
	#КонецЕсли
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииТоваровКомпанииОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ПартииТоваровКомпанииОстаткиИОбороты.Партия КАК Документ.ПоступлениеТоваров)) КАК Партия
	|ПОМЕСТИТЬ Партии
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И НЕ СкладКомпании.Код В (&СкладыИсключения)
	|				И СкладКомпании В ИЕРАРХИИ (&СкладКомпании)
	|				И НЕ СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&ПлощадкиИсключения)
	|				И Партия ССЫЛКА Документ.ПоступлениеТоваров
	|				И СкладКомпании.ВидСклада <> ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ОсновнойСклад)) КАК ПартииТоваровКомпанииОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпанииОстаткиИОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Партии.Номенклатура КАК Номенклатура,
	|	Партии.Партия.ДоговорВзаиморасчетов.Контрагент КАК Поставщик
	|ПОМЕСТИТЬ Поставщики
	|ИЗ
	|	Партии КАК Партии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ АналогичныеТовары
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ОсновнойАртикул <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяССылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.ОсновнойАртикул
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ОсновнойАртикул <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяССылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ОстаткиНовые
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			&НачалоПериода,
	|			СкладКомпании В ИЕРАРХИИ (&СкладКомпании)
	|				И НЕ СкладКомпании.Код В (&СкладыИсключения)
	|				И НЕ СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&ПлощадкиИсключения)
	|				И СкладКомпании.ВидСклада <> ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ОсновнойСклад)) КАК ОстаткиТоваровКомпанииОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОстаткиНовые.СкладКомпании КАК СкладКомпании
	|ПОМЕСТИТЬ НовыеСклады
	|ИЗ
	|	ОстаткиНовые КАК ОстаткиНовые
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОстаткиНовые.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НовыеТовары
	|ИЗ
	|	ОстаткиНовые КАК ОстаткиНовые
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииТоваровКомпанииОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ПартииТоваровКомпанииОстаткиИОбороты.СкладКомпании КАК СкладКомпании,
	|	ПартииТоваровКомпанииОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ПартииТоваровКомпанииОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ПартииТоваровКомпанииОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
	|	ПартииТоваровКомпанииОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА АналогичныеТовары.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Аналоги,
	|	ВЫБОР
	|		КОГДА НовыеТовары.Номенклатура ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НовыйТовар,
	|	ВЫБОР
	|		КОГДА НовыеСклады.СкладКомпании ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НовыйСклад,
	|	Поставщики.Поставщик КАК Поставщик,
	|	ПартииТоваровКомпанииОстаткиИОбороты.СкладКомпании.ВидСклада КАК ВидТТ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОграничениеАссортиментаСрезПоследних.Состояние, 0) = 1
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Выведенный
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И НЕ СкладКомпании.Код В (&СкладыИсключения)
	|				И СкладКомпании В ИЕРАРХИИ (&СкладКомпании)
	|				И НЕ СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&ПлощадкиИсключения)
	|				И СкладКомпании.ВидСклада <> ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ОсновнойСклад)) КАК ПартииТоваровКомпанииОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ АналогичныеТовары КАК АналогичныеТовары
	|		ПО ПартииТоваровКомпанииОстаткиИОбороты.Номенклатура = АналогичныеТовары.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ НовыеТовары КАК НовыеТовары
	|		ПО ПартииТоваровКомпанииОстаткиИОбороты.Номенклатура = НовыеТовары.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ НовыеСклады КАК НовыеСклады
	|		ПО ПартииТоваровКомпанииОстаткиИОбороты.СкладКомпании = НовыеСклады.СкладКомпании
	|		ЛЕВОЕ СОЕДИНЕНИЕ Поставщики КАК Поставщики
	|		ПО ПартииТоваровКомпанииОстаткиИОбороты.Номенклатура = Поставщики.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОграничениеАссортимента.СрезПоследних(&КонецПериода, ) КАК ОграничениеАссортиментаСрезПоследних
	|		ПО ПартииТоваровКомпанииОстаткиИОбороты.Номенклатура = ОграничениеАссортиментаСрезПоследних.Номенклатура
	|			И ПартииТоваровКомпанииОстаткиИОбороты.СкладКомпании.ТорговаяПлощадка = ОграничениеАссортиментаСрезПоследних.ТорговаяПлощадка
	|ИТОГИ ПО
	|	Номенклатура";
	
	
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.Дата-28*86400);
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыОтчета.Дата-1);
	//Запрос.УстановитьПараметр("ВсеСклады", ВсеСклады);
	Запрос.УстановитьПараметр("СкладКомпании", ПараметрыОтчета.Склады);
	Запрос.УстановитьПараметр("СкладыИсключения", ПараметрыОтчета.СкладыИсключения);
	Запрос.УстановитьПараметр("ПлощадкиИсключения", ПараметрыОтчета.ПлощадкиИсключения);
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.Товар) Тогда
		Запрос.УстановитьПараметр("Номенклатура", ПараметрыОтчета.Товар);
	Иначе
		Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
	
	Если ПараметрыОтчета.ИсключитьСклады Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"СкладКомпании В ИЕРАРХИИ","СкладКомпании НЕ В ИЕРАРХИИ");
	КонецЕсли;
	
	Если ПараметрыОтчета.ИсключитьТовар Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Номенклатура В ИЕРАРХИИ","Номенклатура НЕ В ИЕРАРХИИ");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	//	РезультатЗапроса.Выгрузить()
	
	Возврат РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Функция ПолучитьОстатки(ПараметрыОтчета)
	#Если Клиент Тогда
		Состояние("Получаем таблицу остатков по дням...");
	#КонецЕсли
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииТоваровКомпанииОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ПартииТоваровКомпанииОстаткиИОбороты.СкладКомпании КАК СкладКомпании,
	|	НАЧАЛОПЕРИОДА(ПартииТоваровКомпанииОстаткиИОбороты.Период, ДЕНЬ) КАК День,
	|	СУММА(ПартииТоваровКомпанииОстаткиИОбороты.КоличествоНачальныйОстаток) КАК КоличествоНачальныйОстаток,
	|	СУММА(ПартииТоваровКомпанииОстаткиИОбороты.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(ПартииТоваровКомпанииОстаткиИОбороты.КоличествоРасход) КАК КоличествоРасход,
	|	СУММА(ПартииТоваровКомпанииОстаткиИОбороты.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток,
	|	ПартииТоваровКомпанииОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ПартииТоваровКомпанииОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			День,
	|			,
	|			Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И НЕ СкладКомпании.Код В (&СкладыИсключения)
	|				И СкладКомпании В ИЕРАРХИИ (&СкладКомпании)
	|				И НЕ СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&ПлощадкиИсключения)
	|				И СкладКомпании.ВидСклада <> ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ОсновнойСклад)) КАК ПартииТоваровКомпанииОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ПартииТоваровКомпанииОстаткиИОбороты.Период, ДЕНЬ),
	|	ПартииТоваровКомпанииОстаткиИОбороты.СкладКомпании,
	|	ПартииТоваровКомпанииОстаткиИОбороты.Номенклатура,
	|	ПартииТоваровКомпанииОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ПартииТоваровКомпанииОстаткиИОбороты.СуммаКонечныйОстаток
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкладКомпании
	|ИТОГИ ПО
	|	Номенклатура,
	|	СкладКомпании
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.Дата-28*86400);
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыОтчета.Дата-1);
	Запрос.УстановитьПараметр("СкладКомпании", ПараметрыОтчета.Склады);
	Запрос.УстановитьПараметр("СкладыИсключения", ПараметрыОтчета.СкладыИсключения);
	Запрос.УстановитьПараметр("ПлощадкиИсключения", ПараметрыОтчета.ПлощадкиИсключения);
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.Товар) Тогда
		Запрос.УстановитьПараметр("Номенклатура", ПараметрыОтчета.Товар);
	Иначе
		Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
	
	Если ПараметрыОтчета.ИсключитьСклады Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"СкладКомпании В ИЕРАРХИИ","СкладКомпании НЕ В ИЕРАРХИИ");
	КонецЕсли;
	
	Если ПараметрыОтчета.ИсключитьТовар Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Номенклатура В ИЕРАРХИИ","Номенклатура НЕ В ИЕРАРХИИ");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	//	РезультатЗапроса.Выгрузить()
	
	Возврат РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Функция ПолучитьПродажи(ПараметрыОтчета)
	#Если Клиент Тогда
		Состояние("Получаем таблицу продаж по дням...");
	#КонецЕсли
	Запрос=Новый Запрос();
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ) КАК День,
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	ПродажиОбороты.СкладКомпании КАК СкладКомпании,
	|	СУММА(ПродажиОбороты.КоличествоОборот) КАК Оборот,
	|	СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаРозн
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			День,
	|			Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И СкладКомпании В ИЕРАРХИИ (&СкладКомпании)
	|				И ХозОперация В ИЕРАРХИИ (&ХозОперация)
	|				И НЕ СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&ПлощадкиИсключения)
	|				И НЕ СкладКомпании.Код В (&СкладыИсключения)
	|				И СкладКомпании.ВидСклада <> ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ОсновнойСклад)) КАК ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.СкладКомпании,
	|	НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ)
	|ИТОГИ
	|	СУММА(Оборот)
	|ПО
	|	Номенклатура,
	|	СкладКомпании";
	
	Запрос.УстановитьПараметр("ВидДвиженияРасход",ВидДвиженияНакопления.Расход);
	
	
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.Дата-28*86400);
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыОтчета.Дата-1);
	Запрос.УстановитьПараметр("ХозОперация", ПараметрыОтчета.ХозОперация);
	Запрос.УстановитьПараметр("СкладКомпании", ПараметрыОтчета.Склады);
	Запрос.УстановитьПараметр("СкладыИсключения",ПараметрыОтчета. СкладыИсключения);
	Запрос.УстановитьПараметр("ПлощадкиИсключения", ПараметрыОтчета.ПлощадкиИсключения);
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.Товар) Тогда
		Запрос.УстановитьПараметр("Номенклатура", ПараметрыОтчета.Товар);
	Иначе
		Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
	
	Если ПараметрыОтчета.ИсключитьСклады Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"СкладКомпании В ИЕРАРХИИ","СкладКомпании НЕ В ИЕРАРХИИ");
	КонецЕсли;
	
	Если ПараметрыОтчета.ИсключитьТовар Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Номенклатура В ИЕРАРХИИ","Номенклатура НЕ В ИЕРАРХИИ");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	//	РезультатЗапроса.Выгрузить()
	
	Возврат РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции                           

Функция ПолучитьЦены(ПараметрыОтчета)
	#Если Клиент Тогда
		Состояние("Получаем цены...");
	#КонецЕсли
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	ВложенныйЗапрос.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ЦенаЗакупки КАК ЦенаЗакупки,
	|	ВложенныйЗапрос.ЦенаРеализации КАК ЦенаРеализации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Склад КАК Склад,
	|		ВложенныйЗапрос.Склад.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|		СУММА(ВложенныйЗапрос.ЦенаЗакупки) КАК ЦенаЗакупки,
	|		СУММА(ВложенныйЗапрос.ЦенаРеализации) КАК ЦенаРеализации
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СкладыКомпании.Ссылка КАК Склад,
	|			ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|			ЦеныСрезПоследних.Цена КАК ЦенаЗакупки,
	|			0 КАК ЦенаРеализации
	|		ИЗ
	|			Справочник.СкладыКомпании КАК СкладыКомпании
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(
	|						&НаДату,
	|						Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|							И Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК ЦеныСрезПоследних
	|				ПО СкладыКомпании.ТипЦенСебестоимости = ЦеныСрезПоследних.ТипЦен
	|		ГДЕ
	|			СкладыКомпании.Ссылка В ИЕРАРХИИ(&СкладКомпании)
	|			И НЕ СкладыКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&ПлощадкиИсключения)
	|			И НЕ СкладыКомпании.Код В (&СкладыИсключения)
	|			И СкладыКомпании.ВидСклада <> ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ОсновнойСклад)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			СкладыКомпании.Ссылка,
	|			ЦеныСрезПоследних.Номенклатура,
	|			0,
	|			ЦеныСрезПоследних.Цена
	|		ИЗ
	|			Справочник.СкладыКомпании КАК СкладыКомпании
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(
	|						&НаДату,
	|						Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|							И Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК ЦеныСрезПоследних
	|				ПО СкладыКомпании.ТипЦенРозничнойТорговли = ЦеныСрезПоследних.ТипЦен
	|		ГДЕ
	|			СкладыКомпании.Ссылка В ИЕРАРХИИ(&СкладКомпании)
	|			И НЕ СкладыКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&ПлощадкиИсключения)
	|			И НЕ СкладыКомпании.Код В (&СкладыИсключения)
	|			И СкладыКомпании.ВидСклада <> ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ОсновнойСклад)) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Склад,
	|		ВложенныйЗапрос.Склад.ТорговаяПлощадка,
	|		ВложенныйЗапрос.Номенклатура) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("НаДату",ПараметрыОтчета.Дата);
	Запрос.УстановитьПараметр("СкладКомпании", ПараметрыОтчета.Склады);
	Запрос.УстановитьПараметр("СкладыИсключения", ПараметрыОтчета.СкладыИсключения);
	Запрос.УстановитьПараметр("ПлощадкиИсключения", ПараметрыОтчета.ПлощадкиИсключения);
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.Товар) Тогда
		Запрос.УстановитьПараметр("Номенклатура", ПараметрыОтчета.Товар);
	Иначе
		Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
	
	Если ПараметрыОтчета.ИсключитьСклады Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"СкладыКомпании.Ссылка В ИЕРАРХИИ","СкладыКомпании.Ссылка НЕ В ИЕРАРХИИ");
	КонецЕсли;
	
	Если ПараметрыОтчета.ИсключитьТовар Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Номенклатура В ИЕРАРХИИ","Номенклатура НЕ В ИЕРАРХИИ");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьВитрину(ПараметрыОтчета)
	#Если Клиент Тогда
		Состояние("Получаем витрину...");
	#КонецЕсли
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СкладыКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка
	|ПОМЕСТИТЬ ТП
	|ИЗ
	|	Справочник.СкладыКомпании КАК СкладыКомпании
	|ГДЕ
	|	СкладыКомпании.Ссылка В ИЕРАРХИИ(&СкладКомпании)
	|	И НЕ СкладыКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&ПлощадкиИсключения)
	|	И НЕ СкладыКомпании.Код В (&СкладыИсключения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОптимальноеКоличествоНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ОптимальноеКоличествоНоменклатурыСрезПоследних.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ОптимальноеКоличествоНоменклатурыСрезПоследних.ВитринаОстаток КАК ВитринаОстаток,
	|	ОптимальноеКоличествоНоменклатурыСрезПоследних.ПоДоговоруОстаток КАК ПоДоговоруОстаток
	|ИЗ
	|	РегистрСведений.ТК_ОптимальноеКоличествоНоменклатуры.СрезПоследних(
	|			&НаДату,
	|			Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И ТорговаяПлощадка В
	|					(ВЫБРАТЬ
	|						ТорговыеПлощадки.ТорговаяПлощадка
	|					ИЗ
	|						ТП КАК ТорговыеПлощадки)) КАК ОптимальноеКоличествоНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату",ПараметрыОтчета.Дата);
	Запрос.УстановитьПараметр("СкладКомпании", ПараметрыОтчета.Склады);
	Запрос.УстановитьПараметр("СкладыИсключения", ПараметрыОтчета.СкладыИсключения);
	Запрос.УстановитьПараметр("ПлощадкиИсключения", ПараметрыОтчета.ПлощадкиИсключения);
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.Товар) Тогда
		Запрос.УстановитьПараметр("Номенклатура", ПараметрыОтчета.Товар);
	Иначе
		Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
	
	Если ПараметрыОтчета.ИсключитьСклады Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"СкладыКомпании.Ссылка В ИЕРАРХИИ","СкладыКомпании.Ссылка НЕ В ИЕРАРХИИ");
	КонецЕсли;
	
	Если ПараметрыОтчета.ИсключитьТовар Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Номенклатура В ИЕРАРХИИ","Номенклатура НЕ В ИЕРАРХИИ");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьАВС(ПараметрыОтчета)
	#Если Клиент Тогда
		Состояние("Получаем АВС анализ...");
	#КонецЕсли
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиОбороты.СкладКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	СУММА(ПродажиОбороты.СуммаУпрОборот) КАК ОборотВесь
	|ПОМЕСТИТЬ ПродажиЗаПериод
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ХозОперация В ИЕРАРХИИ (&ХозОперация)
	|				И СкладКомпании В ИЕРАРХИИ (&СкладКомпании)
	|				И НЕ СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&ПлощадкиИсключения)
	|				И НЕ СкладКомпании.Код В (&СкладыИсключения)
	|				И СкладКомпании.ВидСклада <> ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ОсновнойСклад)) КАК ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.СкладКомпании.ТорговаяПлощадка,
	|	ПродажиОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиЗаПериод.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ВЫБОР
	|		КОГДА ПродажиЗаПериод.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.номенклатура.ПустаяСсылка)
	|			ТОГДА ПродажиЗаПериод.Номенклатура.Родитель.Родитель
	|		ИНАЧЕ ПродажиЗаПериод.Номенклатура.Родитель
	|	КОНЕЦ КАК Группа,
	|	СУММА(ПродажиЗаПериод.ОборотВесь) КАК КоличествоПоказатель,
	|	ПродажиЗаПериод.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаВыборки
	|ИЗ
	|	ПродажиЗаПериод КАК ПродажиЗаПериод
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиЗаПериод.ТорговаяПлощадка,
	|	ПродажиЗаПериод.Номенклатура,
	|	ВЫБОР
	|		КОГДА ПродажиЗаПериод.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.номенклатура.ПустаяСсылка)
	|			ТОГДА ПродажиЗаПериод.Номенклатура.Родитель.Родитель
	|		ИНАЧЕ ПродажиЗаПериод.Номенклатура.Родитель
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(ПродажиЗаПериод.ОборотВесь) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ТорговаяПлощадка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗначенияПоказателяПоГруппировкам.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ЗначенияПоказателяПоГруппировкам.Группа КАК Группа,
	|	ЗначенияПоказателяПоГруппировкам.Номенклатура КАК Номенклатура,
	|	ЗначенияПоказателяПоГруппировкам.КоличествоПоказатель КАК КоличествоПоказатель,
	|	ВЫБОР
	|		КОГДА ЗначенияПоказателяПоГруппировкамДляСоединения.ТорговаяПлощадка = ВыборкаОбщегоПоказателя.ТорговаяПлощадка
	|				И ЗначенияПоказателяПоГруппировкамДляСоединения.Группа = ВыборкаОбщегоПоказателя.Группа
	|			ТОГДА ВЫБОР
	|					КОГДА СУММА(ЗначенияПоказателяПоГруппировкамДляСоединения.КоличествоПоказатель) <= ВыборкаОбщегоПоказателя.КоличествоПоказатель * &ОбъемКласса_C / 100
	|						ТОГДА ""C""
	|					КОГДА СУММА(ЗначенияПоказателяПоГруппировкамДляСоединения.КоличествоПоказатель) <= ВыборкаОбщегоПоказателя.КоличествоПоказатель * (&ОбъемКласса_C + &ОбъемКласса_B) / 100
	|						ТОГДА ""B""
	|					ИНАЧЕ ""A""
	|				КОНЕЦ
	|		ИНАЧЕ ""нет""
	|	КОНЕЦ КАК ГруппаАВС
	|ИЗ
	|	ТаблицаВыборки КАК ЗначенияПоказателяПоГруппировкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВыборки КАК ЗначенияПоказателяПоГруппировкамДляСоединения
	|		ПО ЗначенияПоказателяПоГруппировкам.ТорговаяПлощадка = ЗначенияПоказателяПоГруппировкамДляСоединения.ТорговаяПлощадка
	|			И ЗначенияПоказателяПоГруппировкам.КоличествоПоказатель >= ЗначенияПоказателяПоГруппировкамДляСоединения.КоличествоПоказатель
	|			И ЗначенияПоказателяПоГруппировкам.Группа = ЗначенияПоказателяПоГруппировкамДляСоединения.Группа
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ТаблицаВыборки.КоличествоПоказатель) КАК КоличествоПоказатель,
	|			ТаблицаВыборки.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|			ТаблицаВыборки.Группа КАК Группа
	|		ИЗ
	|			ТаблицаВыборки КАК ТаблицаВыборки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаВыборки.ТорговаяПлощадка,
	|			ТаблицаВыборки.Группа) КАК ВыборкаОбщегоПоказателя
	|		ПО ЗначенияПоказателяПоГруппировкам.ТорговаяПлощадка = ВыборкаОбщегоПоказателя.ТорговаяПлощадка
	|			И ЗначенияПоказателяПоГруппировкам.Группа = ВыборкаОбщегоПоказателя.Группа
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗначенияПоказателяПоГруппировкам.Группа,
	|	ЗначенияПоказателяПоГруппировкам.Номенклатура,
	|	ЗначенияПоказателяПоГруппировкам.ТорговаяПлощадка,
	|	ЗначенияПоказателяПоГруппировкам.КоличествоПоказатель,
	|	ЗначенияПоказателяПоГруппировкамДляСоединения.ТорговаяПлощадка,
	|	ВыборкаОбщегоПоказателя.ТорговаяПлощадка,
	|	ВыборкаОбщегоПоказателя.КоличествоПоказатель,
	|	ЗначенияПоказателяПоГруппировкамДляСоединения.Группа,
	|	ВыборкаОбщегоПоказателя.Группа
	|
	|ИМЕЮЩИЕ
	|	ВЫБОР
	|		КОГДА ЗначенияПоказателяПоГруппировкамДляСоединения.ТорговаяПлощадка = ВыборкаОбщегоПоказателя.ТорговаяПлощадка
	|				И ЗначенияПоказателяПоГруппировкамДляСоединения.Группа = ВыборкаОбщегоПоказателя.Группа
	|			ТОГДА ВЫБОР
	|					КОГДА СУММА(ЗначенияПоказателяПоГруппировкамДляСоединения.КоличествоПоказатель) <= ВыборкаОбщегоПоказателя.КоличествоПоказатель * &ОбъемКласса_C / 100
	|						ТОГДА ""C""
	|					КОГДА СУММА(ЗначенияПоказателяПоГруппировкамДляСоединения.КоличествоПоказатель) <= ВыборкаОбщегоПоказателя.КоличествоПоказатель * (&ОбъемКласса_C + &ОбъемКласса_B) / 100
	|						ТОГДА ""B""
	|					ИНАЧЕ ""A""
	|				КОНЕЦ
	|		ИНАЧЕ ""нет""
	|	КОНЕЦ <> ""нет""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПродажиЗаПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаВыборки";
	
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.Дата-28*86400);
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыОтчета.Дата-1);
	Запрос.УстановитьПараметр("ХозОперация", ПараметрыОтчета.ХозОперация);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ОбъемКласса_B", 15);
	Запрос.УстановитьПараметр("ОбъемКласса_C", 5);
	Запрос.УстановитьПараметр("СкладКомпании", ПараметрыОтчета.Склады);
	Запрос.УстановитьПараметр("СкладыИсключения", ПараметрыОтчета.СкладыИсключения);
	Запрос.УстановитьПараметр("ПлощадкиИсключения", ПараметрыОтчета.ПлощадкиИсключения);
	
	Если ПараметрыОтчета.ИсключитьСклады Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"СкладКомпании В ИЕРАРХИИ","СкладКомпании НЕ В ИЕРАРХИИ");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ОтчетВывести(ПараметрыОтчета,Авто=Ложь,Наименование="")	Экспорт
	
	ВсЁОк = Истина;
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ПродажиВНоль";
	СтруктураЗаписиЖурнала.КлючОбработки = Наименование;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.", СтруктураЗаписиЖурнала);
	
	ТабДок = Новый ТабличныйДокумент;
	
	ХозОперация = Новый СписокЗначений;
	ХозОперация.Добавить(Справочники.ХозОперации.ЗакрытиеСмены);
	ХозОперация.Добавить(Справочники.ХозОперации.РеализацияТоваровРозница);
	ПараметрыОтчета.Вставить("ХозОперация",ХозОперация);	
	
	СкладыИсключения = Новый СписокЗначений;
	СкладыИсключения.Добавить("A51");	//	Основной склад АТ
	СкладыИсключения.Добавить("S300");	//	Офисный склад СБС
	СкладыИсключения.Добавить("O300");	//	Офисный склад ОИ
	СкладыИсключения.Добавить("O460");	//	Энгельса, 33 - Торговый зал (Основа Инфо)
	ПараметрыОтчета.Вставить("СкладыИсключения",СкладыИсключения);	
	
	ПлощадкиИсключения = Новый СписокЗначений;
	ПлощадкиИсключения.Добавить(Справочники.ТорговыеПлощадки.НайтиПоКоду("ХGL000295"));		//	04 РЦ ТАБАК
	ПлощадкиИсключения.Добавить(Справочники.ТорговыеПлощадки.НайтиПоКоду("ХGL000297"));		//	05 РЦ ВОДА
	ПлощадкиИсключения.Добавить(Справочники.ТорговыеПлощадки.НайтиПоКоду("DaL005"));		//	Распределительный центр - Харьков Аттика
	ПараметрыОтчета.Вставить("ПлощадкиИсключения",ПлощадкиИсключения);	
	
	Сообщить("Начало     "+ТекущаяДата());
	
	ВыборкаНоменклатура = ПолучитьТовары(ПараметрыОтчета);
	РезультатыВыполнения.ДобавитьКомментарий("ПолучитьТовары ("+ВыборкаНоменклатура.Количество()+")", СтруктураЗаписиЖурнала);
	Сообщить("Ок.Товар   "+ТекущаяДата()+"		- "+ВыборкаНоменклатура.Количество());
	
	Если ВыборкаНоменклатура.Количество()=0 Тогда
		Если Авто Тогда
			Попытка 
				РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, Ложь);
			Исключение
				//
			КонецПопытки;
		КонецЕсли;
		Возврат ТабДок;
	КонецЕсли;
	
	Попытка
		
		мОстатки = ПолучитьОстатки(ПараметрыОтчета);
		РезультатыВыполнения.ДобавитьКомментарий("ПолучитьОстатки ()", СтруктураЗаписиЖурнала);
		Сообщить("Ок.Остатки "+ТекущаяДата());
		
		мПродаж = ПолучитьПродажи(ПараметрыОтчета);
		РезультатыВыполнения.ДобавитьКомментарий("ПолучитьПродажи ()", СтруктураЗаписиЖурнала);
		Сообщить("Ок.Продажи "+ТекущаяДата());
		
		//ТаблицаЦен = ПолучитьЦены();
		//Сообщить("Ок.Цены    "+ТекущаяДата());
		
		ТаблицаАВС = ПолучитьАВС(ПараметрыОтчета);
		РезультатыВыполнения.ДобавитьКомментарий("ПолучитьАВС ()", СтруктураЗаписиЖурнала);
		Сообщить("Ок.АВС     "+ТекущаяДата());
		
		тВитрина = ПолучитьВитрину(ПараметрыОтчета);
		РезультатыВыполнения.ДобавитьКомментарий("ПолучитьВитрину()", СтруктураЗаписиЖурнала);
		Сообщить("Ок.Витрина "+ТекущаяДата());
		
		СоответствиеДней = Новый Соответствие;
		Для д=1 По 28 Цикл
			СоответствиеДней.Вставить(ПараметрыОтчета.Дата-(29-д)*86400,д);
		КонецЦикла;
		
		Макет = Отчеты.ПродажиВНоль.ПолучитьМакет("Макет");
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		
		ТабДок.Очистить();
		//ТабДок.Вывести(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьШапка);
		
	Исключение
		ВсЁОк = Ложь;
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Продажи в ноль",УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
		РезультатыВыполнения.СообщитьОбОшибке(ТекстОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
	КонецПопытки;
	
	Если Авто Тогда
		Попытка 
			РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, Ложь);
		Исключение
			//
		КонецПопытки;
	КонецЕсли;
	
	строкаТД = 0;
	вНоменклатура = 0;
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Попытка
			
			вНоменклатура = 1+вНоменклатура;
			СтрокаТоварСкладПродажа = мПродаж.Строки.Найти(ВыборкаНоменклатура.Номенклатура,"Номенклатура");
			СтрокаТоварСкладОстатки = мОстатки.Строки.Найти(ВыборкаНоменклатура.Номенклатура,"Номенклатура");
			
			ВыборкаСклад = ВыборкаНоменклатура.Выбрать();
			вСклад = 0;
			Пока ВыборкаСклад.Следующий() Цикл
				#Если Клиент Тогда
					Состояние("Выводим данные...Осталось вывести товара "+(ВыборкаНоменклатура.Количество()-вНоменклатура)+" по "+(ВыборкаСклад.Количество()-вСклад)+" складам...");
				#КонецЕсли
				вСклад = 1+вСклад;
				Если СтрокаТоварСкладПродажа = Неопределено Тогда
					СтрокаДереваПродажа = Неопределено;
				Иначе
					СтрокаДереваПродажа=СтрокаТоварСкладПродажа.Строки.Найти(ВыборкаСклад.СкладКомпании,"СкладКомпании");
				КонецЕсли;
				
				Если СтрокаТоварСкладОстатки = Неопределено Тогда
					СтрокаДереваОстатки = Неопределено;
				Иначе
					СтрокаДереваОстатки=СтрокаТоварСкладОстатки.Строки.Найти(ВыборкаСклад.СкладКомпании,"СкладКомпании");
				КонецЕсли;
				
				строка = ОбластьСтрока.Параметры;
				#Если Клиент Тогда
					ОбработкаПрерыванияПользователя();
				#КонецЕсли
				//строка = ТЗ.Добавить();
				строка.Артикул = ВыборкаСклад.Номенклатура.Артикул;
				строка.Номенклатура = ВыборкаСклад.Номенклатура;
				строка.ТоварнаяМарка = ?(ЗначениеЗаполнено(ВыборкаСклад.Номенклатура.ТоварнаяМарка.Родитель),ВыборкаСклад.Номенклатура.ТоварнаяМарка.Родитель,ВыборкаСклад.Номенклатура.ТоварнаяМарка);
				строка.Аналог = ВыборкаСклад.Аналоги;
				строка.НовыйТовар = ВыборкаСклад.НовыйТовар;
				строка.НовыйСклад = ВыборкаСклад.НовыйСклад;
				строка.Родитель = ВыборкаСклад.Номенклатура.Родитель;
				//строка.Группа = ?(ЗначениеЗаполнено(ВыборкаСклад.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель),ВыборкаСклад.Номенклатура.Родитель.Родитель,ВыборкаСклад.Номенклатура.Родитель);
				строка.Группа = ВыборкаСклад.Номенклатура.Родитель.Родитель.Родитель;
				строка.Поставщик = ВыборкаСклад.Поставщик;
				строка.Код = СокрЛП(ВыборкаСклад.СкладКомпании.Код);
				строка.Склад = ВыборкаСклад.СкладКомпании;
				мГруппаАВС = ТаблицаАВС.НайтиСтроки(Новый Структура("ТорговаяПлощадка,Номенклатура",ВыборкаСклад.СкладКомпании.ТорговаяПлощадка,ВыборкаСклад.Номенклатура));
				строка.ГруппаАВС = ?(мГруппаАВС.Количество()=0,"С1",мГруппаАВС[0].ГруппаАВС);
				мВитрина = тВитрина.НайтиСтроки(Новый Структура("ТорговаяПлощадка,Номенклатура",ВыборкаСклад.СкладКомпании.ТорговаяПлощадка,ВыборкаСклад.Номенклатура));
				строка.Витрина = ?(мВитрина.Количество()=0,0,мВитрина[0].ВитринаОстаток);
				строка.ПоДоговору = ?(мВитрина.Количество()=0,0,мВитрина[0].ПоДоговоруОстаток);
				строка.Выведенный = ВыборкаСклад.Выведенный;
				строка.ВидТТ = ВыборкаСклад.СкладКомпании.ВидСклада;
				//мЦены = ТаблицаЦен.НайтиСтроки(Новый Структура("Склад,Номенклатура",ВыборкаСклад.СкладКомпании,ВыборкаСклад.Номенклатура));
				//строка.ЦенаЗакупки = ?(мЦены.Количество()=0,0,мЦены[0].ЦенаЗакупки);
				//строка.ЦенаРеализации = ?(мЦены.Количество()=0,0,мЦены[0].ЦенаРеализации);
				
				//Выборка = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				СредОстатки_Шт = 0;
				ОстаткиШт = 0;
				ПродажиШт = 0;
				ОстаткиГрн = 0;
				ПродажиГрн = 0;
				КолвоДнейСОстатком = 0;
				ПоследнийОстатокШт=0;
				ПоследнийОстатокГрн=0;
				
				ВремДатаНачала=НачалоДня(ПараметрыОтчета.Дата-28*86400);
				Пока ВремДатаНачала<=НачалоДня(ПараметрыОтчета.Дата-1) Цикл
					ДеньАнализа = СоответствиеДней.Получить(ВремДатаНачала);
					СтрокаДеньПродаж=Неопределено;
					СтрокаДеньОстатка=Неопределено;
					#Если Клиент Тогда
						ОбработкаПрерыванияПользователя();
					#КонецЕсли
					Если СтрокаДереваПродажа = Неопределено Тогда
						строка["Р"+ДеньАнализа] = 0;
					Иначе
						СтрокаДеньПродаж=СтрокаДереваПродажа.Строки.Найти(ВремДатаНачала,"День");
						Если СтрокаДеньПродаж = Неопределено Тогда
							строка["Р"+ДеньАнализа] = 0;
						Иначе
							ПродажиШт = ПродажиШт + СтрокаДеньПродаж.Оборот;
							ПродажиГрн= ПродажиГрн+ СтрокаДеньПродаж.СуммаРозн;
							строка["Р"+ДеньАнализа] = СтрокаДеньПродаж.Оборот;
							//СтрокаДереваПродажа.Строки.Удалить(СтрокаДеньПродаж);
						КонецЕсли;
					КонецЕсли;
					
					СтрокаДеньОстатка=СтрокаДереваОстатки.Строки.Найти(ВремДатаНачала,"День");
					
					Если СтрокаДеньОстатка = Неопределено Тогда
						строка["О"+ДеньАнализа] = ПоследнийОстатокШт;
						ОстаткиШт = ОстаткиШт + ПоследнийОстатокШт;
						ОстаткиГрн = ОстаткиГрн + ПоследнийОстатокГрн;
					Иначе
						СредОстатки_Шт = СредОстатки_Шт + СтрокаДеньОстатка.КоличествоНачальныйОстаток;
						ОстаткиШт = ОстаткиШт + СтрокаДеньОстатка.КоличествоНачальныйОстаток;
						ОстаткиГрн= ОстаткиГрн+ СтрокаДеньОстатка.СуммаНачальныйОстаток;
						строка["О"+ДеньАнализа] = СтрокаДеньОстатка.КоличествоНачальныйОстаток;
						ПоследнийОстатокШт = СтрокаДеньОстатка.КоличествоКонечныйОстаток;
						ПоследнийОстатокГрн = СтрокаДеньОстатка.СуммаКонечныйОстаток;
						//СтрокаДереваОстатки.Строки.Удалить(СтрокаДеньОстатка);
					КонецЕсли;
					
					//Если ЗначениеЗаполнено(строка["О"+ДеньАнализа]) Тогда
					Если (строка["О"+ДеньАнализа]-строка.Витрина)>0 Тогда
						КолвоДнейСОстатком = КолвоДнейСОстатком + 1;
					КонецЕсли;
					
					ВремДатаНачала=ВремДатаНачала+86400;
				КонецЦикла;
				
				//Пока Выборка.Следующий() Цикл
				//	ОбработкаПрерыванияПользователя();
				//	ОстаткиШт = ОстаткиШт + Выборка.Остаток;
				//	ПродажиШт = ПродажиШт + Выборка.Реализация;
				//	строка["Р"+СоответствиеДней.Получить(Выборка.День)] = Выборка.Реализация;
				//	строка["О"+СоответствиеДней.Получить(Выборка.День)] = Выборка.Остаток;
				//	Если ЗначениеЗаполнено(Выборка.Остаток) Тогда
				//		КолвоДнейСОстатком = КолвоДнейСОстатком + 1;
				//	КонецЕсли;
				//КонецЦикла;
				КолвоДнейБезОстатка = 28 - КолвоДнейСОстатком;
				строка.КолвоДнейБезОстатка = КолвоДнейБезОстатка;
				строка.ЦенаЗакупки = ?(ОстаткиШт=0,0,ОстаткиГрн/ОстаткиШт);
				строка.ЦенаРеализации = ?(ПродажиШт=0,0,ПродажиГрн/ПродажиШт);
				строка.СуммаРеализацииЗак = ПродажиШт*строка.ЦенаЗакупки;
				строка.СуммаРеализацииРеал = ПродажиГрн;
				строка.РеализацияШт = ПродажиШт;
				//строка.СреднеДневныеПродажиШт = ?(КолвоДнейБезОстатка=28,0,ПродажиШт / (28-КолвоДнейБезОстатка));
				//строка.СреднеДневныеПродажиГрнЗак = строка.СреднедневныеПродажиШт * строка.ЦенаЗакупки;
				//строка.СреднеДневныеПродажиГрнРеал = строка.СреднедневныеПродажиШт * строка.ЦенаРеализации;
				СреднеДневныеПродажиШт = ?(КолвоДнейБезОстатка=28,0,ПродажиШт / (28-КолвоДнейБезОстатка));
				СреднеДневныеПродажиГрнРеал = СреднедневныеПродажиШт * строка.ЦенаРеализации;
				строка.Потери = КолвоДнейБезОстатка * СреднеДневныеПродажиГрнРеал;
				строка.ТЗ = ?(СреднедневныеПродажиШт=0,0,?(строка.О28 = Неопределено,0,строка.О28 / СреднедневныеПродажиШт));
				//строка.СреднедневныеОстаткиШт = ?(КолвоДнейБезОстатка=28,0,ОстаткиШт / (28-КолвоДнейБезОстатка));
				//строка.СреднедневныеОстаткиГрнЗак = строка.СреднедневныеОстаткиШт * строка.ЦенаЗакупки;
				//строка.ОборачиваемостьШт = ?(ПродажиШт=0,0,ОстаткиШт/ПродажиШт);
				//строка.ОборачиваемостьГрнЗак = строка.ОборачиваемостьШт * строка.ЦенаЗакупки;
				строка.КонечныеОстаткиЩт = строка.О28;
				строка.КонечныеОстаткиГрнЗак = ?(строка.О28 = Неопределено,0,строка.О28) * строка.ЦенаЗакупки;
				строка.НачальныйОстатокГрнЗак = ?(строка.О1 = Неопределено,0,строка.О1) * строка.ЦенаЗакупки; 
				ТабДок.Вывести(ОбластьСтрока);
				//Если СтрокаДереваПродажа <> Неопределено Тогда
				//	СтрокаТоварСкладПродажа.Строки.Удалить(СтрокаДереваПродажа);
				//КонецЕсли;
				//Если СтрокаДереваОстатки <> Неопределено Тогда
				//	СтрокаТоварСкладОстатки.Строки.Удалить(СтрокаДереваОстатки);
				//КонецЕсли;
				Если Авто Тогда
					строкаТД = 1 + строкаТД;
					Если строкаТД/25000 = Цел(строкаТД/25000) Тогда
						РезультатыВыполнения.ДобавитьКомментарий("Добавлена "+строкаТД+" строка", СтруктураЗаписиЖурнала);
						Попытка 
							РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, Ложь);
						Исключение
							//
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			//Если СтрокаТоварСкладПродажа <> Неопределено Тогда
			//	мПродаж.Строки.Удалить(СтрокаТоварСкладПродажа);
			//КонецЕсли;
			//Если СтрокаТоварСкладОстатки <> Неопределено Тогда
			//	мОстатки.Строки.Удалить(СтрокаТоварСкладОстатки);
			//КонецЕсли;
			
		Исключение
			ВсЁОк = Ложь;
			ТекстОшибки = ОписаниеОшибки();
			РезультатыВыполнения.СообщитьОбОшибке(ТекстОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			ЗаписьЖурналаРегистрации("Продажи в ноль",УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
			Если Авто Тогда
				Попытка 
					РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, Ложь);
				Исключение
					//
				КонецПопытки;
			КонецЕсли;
			
		КонецПопытки;
	КонецЦикла;
	Сообщить("Окончание  "+ТекущаяДата());
	
	РезультатыВыполнения.ДобавитьКомментарий("Добавлено "+строкаТД+" строк", СтруктураЗаписиЖурнала);
	Если Авто Тогда
		Попытка 
			РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, Ложь);
		Исключение
			//
		КонецПопытки;
	КонецЕсли;
	Попытка
		//Состояние("Выводим данные...");
		//Макет = ПолучитьМакет("Макет");
		//
		//ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		//ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		//ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		//
		//ТабДок.Очистить();
		//ТабДок.Вывести(ОбластьЗаголовок);
		//ТабДок.Вывести(ОбластьШапка);
		//Для Каждого стр Из ТЗ Цикл
		//	ОбработкаПрерыванияПользователя();
		//	ОбластьСтрока.Параметры.Заполнить(стр);
		//	ТабДок.Вывести(ОбластьСтрока);
		//КонецЦикла;
		ТабДок.ФиксацияСверху = 1;	
		//ТабДок.ИспользуемоеИмяФайла = "НулевыеПродажиАттика "+Формат(Дата,"ДФ=dd.MM.yyyy");
		Если Авто Тогда
			Каталог = "\\space.digma\office\departments\Служба_Аналитики\Отчеты Аналитика\Нулевые продажи\";
			//Каталог = "\\FS02-Shared\АттикаПродажи\";
			ИмяФайла = "НулевыеПродажи "+Формат(ПараметрыОтчета.Дата,"ДФ=yyyy-MM-dd")+" "+Наименование;
			//ТабДок.Записать(Каталог+ИмяФайла+".MXL",ТипФайлаТабличногоДокумента.MXL);	
			//ТабДок.Записать(Каталог+ИмяФайла+".XLSX",ТипФайлаТабличногоДокумента.XLSX);
			//ИмяВременногоФайла = ПолучитьИмяВременногоФайла("MXL");
			ПутьФайлаMXL	= Каталог+"_"+ИмяФайла+".MXL";
			ПутьФайлаXLSX	= Каталог+ИмяФайла+".XLSX";
			ТабДок.Записать(ПутьФайлаMXL,ТипФайлаТабличногоДокумента.MXL);	
			РезультатыВыполнения.ДобавитьКомментарий(ПутьФайлаMXL, СтруктураЗаписиЖурнала);
			ТабДок.Записать(ПутьФайлаXLSX,ТипФайлаТабличногоДокумента.XLSX);
			РезультатыВыполнения.ДобавитьКомментарий(ПутьФайлаXLSX, СтруктураЗаписиЖурнала);
			УдалитьФайлы(ПутьФайлаMXL);
			РезультатыВыполнения.ДобавитьКомментарий("Конец обработки.", СтруктураЗаписиЖурнала);
			
			Попытка
				РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк);
			Исключение
				//
			КонецПопытки;
			
			//ЗаписьЖурналаРегистрации("Продажи в ноль Аттика",УровеньЖурналаРегистрации.Информация,,,ПутьФайлаXLSX);
		Иначе
			Возврат ТабДок;
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("Продажи в ноль",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		ВсЁОк = Ложь;
		ТекстОшибки = ОписаниеОшибки();
		РезультатыВыполнения.СообщитьОбОшибке(ТекстОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
		Если Авто Тогда
			Попытка 
				РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк);
			Исключение
				//
			КонецПопытки;
		КонецЕсли;
		
	КонецПопытки;
	
	
КонецФункции
